#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_instance.chat must be replaced
-/+ resource "google_compute_instance" "chat" {
        can_ip_forward          = false
      ~ cpu_platform            = "Intel Skylake" -> (known after apply)
        deletion_protection     = false
      - enable_display          = false -> null
      ~ guest_accelerator       = [] -> (known after apply)
      ~ id                      = "projects/cmc-things/zones/northamerica-northeast1-a/instances/chat" -> (known after apply)
      ~ instance_id             = "2540796590299541014" -> (known after apply)
      ~ label_fingerprint       = "42WmSpB8rSM=" -> (known after apply)
      - labels                  = {} -> null
        machine_type            = "f1-micro"
      - metadata                = {} -> null
      ~ metadata_fingerprint    = "5qtXVLR4bM4=" -> (known after apply)
      + metadata_startup_script = "#!/bin/bash\n\nset -euo pipefail\n\necho \"Creating the synapse user\"\nid -u synapse &>/dev/null || useradd -u 1337 synapse\n\necho \"Dropping permissions\"\nsu - synapse\n\nif [ -d \"cmc\" ]; then\n  echo \"Repo directory exists; pulling\"\n  cd cmc\n  git pull origin master\nelse\n  echo \"Cloning repo\"\n  git clone ssh://git@github.com/j3parker/cmc\n  cd cmc\nfi \n\necho \"Starting containers\"\ncd chat\ndocker-compose up\n" # forces replacement
      + min_cpu_platform        = (known after apply)
        name                    = "chat"
      ~ project                 = "cmc-things" -> (known after apply)
      ~ self_link               = "https://www.googleapis.com/compute/v1/projects/cmc-things/zones/northamerica-northeast1-a/instances/chat" -> (known after apply)
      - tags                    = [] -> null
      ~ tags_fingerprint        = "42WmSpB8rSM=" -> (known after apply)
        zone                    = "northamerica-northeast1-a"

      ~ boot_disk {
            auto_delete                = true
          ~ device_name                = "persistent-disk-0" -> (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
            mode                       = "READ_WRITE"
          ~ source                     = "https://www.googleapis.com/compute/v1/projects/cmc-things/zones/northamerica-northeast1-a/disks/chat" -> (known after apply)

          ~ initialize_params {
                image  = "https://www.googleapis.com/compute/v1/projects/gce-uefi-images/global/images/ubuntu-1804-bionic-v20191113"
              ~ labels = {} -> (known after apply)
              ~ size   = 10 -> (known after apply)
              ~ type   = "pd-standard" -> (known after apply)
            }
        }

      ~ network_interface {
          ~ name               = "nic0" -> (known after apply)
          ~ network            = "https://www.googleapis.com/compute/v1/projects/cmc-things/global/networks/default" -> "default"
          ~ network_ip         = "10.162.0.2" -> (known after apply)
          ~ subnetwork         = "https://www.googleapis.com/compute/v1/projects/cmc-things/regions/northamerica-northeast1/subnetworks/default" -> (known after apply)
          ~ subnetwork_project = "cmc-things" -> (known after apply)

          ~ access_config {
                nat_ip       = "34.95.33.143"
              ~ network_tier = "PREMIUM" -> (known after apply)
            }
        }

      ~ scheduling {
          ~ automatic_restart   = true -> (known after apply)
          ~ on_host_maintenance = "MIGRATE" -> (known after apply)
          ~ preemptible         = false -> (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }

      - shielded_instance_config {
          - enable_integrity_monitoring = true -> null
          - enable_secure_boot          = false -> null
          - enable_vtpm                 = true -> null
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>

*Workflow: `Terraform Test`, Action: `hashicorpterraform-github-actions3`, Working Directory: `terraform`*
